#Пользователь вводит два числа. Найдите сумму и произдеведение данных чисел.

first_number = int(input("Введите первое число:"))
second_number = int(input("Введите второе число:"))

print(f"This is sum of numbers: {first_number + second_number}")
print(f"This is multiplication of numbers: {first_number * second_number}")

