# Task 4 =================================================================================

# ТЗ: Создать массив, каждый элемент которого равен квадрату своего номера.

# Developer notes: Испльзуйте range() и for

# Входные данные:
# длинна массива = 20
# ========================================================================================

a = 20  # List length
list_geometric = []

for i in range(a):
    list_geometric.append(i**2)

print(list_geometric)
